Results/Swarm/13-01-22/3/multiple-clients/swarm-sn-wrk-mixed-c6525-25g-exp3-havail0-hori1-verti1-infi0-client3-t8-c512-d30-R200
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=200
Running 30s test @ http://10.10.1.8:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 3.218ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.147ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.104ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.170ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.112ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.060ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.262ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.258ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.30ms    1.91ms   7.54ms   70.54%
    Req/Sec    25.68     48.99   200.00     75.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.08ms
 75.000%    5.09ms
 90.000%    5.82ms
 99.000%    7.54ms
 99.900%    8.99ms
 99.990%   27.85ms
 99.999%   27.85ms
100.000%   27.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.926     0.000000            1         1.00
       1.457     0.100000          395         1.11
       1.619     0.200000          786         1.25
       1.766     0.300000         1179         1.43
       1.896     0.400000         1572         1.67
       2.075     0.500000         1964         2.00
       2.493     0.550000         2160         2.22
       4.175     0.600000         2357         2.50
       4.623     0.650000         2554         2.86
       4.879     0.700000         2749         3.33
       5.099     0.750000         2948         4.00
       5.211     0.775000         3052         4.44
       5.315     0.800000         3142         5.00
       5.423     0.825000         3242         5.71
       5.539     0.850000         3338         6.67
       5.683     0.875000         3439         8.00
       5.763     0.887500         3487         8.89
       5.819     0.900000         3536        10.00
       5.887     0.912500         3586        11.43
       5.955     0.925000         3637        13.33
       6.075     0.937500         3684        16.00
       6.155     0.943750         3709        17.78
       6.219     0.950000         3732        20.00
       6.303     0.956250         3758        22.86
       6.455     0.962500         3780        26.67
       6.579     0.968750         3805        32.00
       6.667     0.971875         3817        35.56
       6.755     0.975000         3829        40.00
       6.923     0.978125         3842        45.71
       7.099     0.981250         3854        53.33
       7.223     0.984375         3866        64.00
       7.347     0.985938         3872        71.11
       7.455     0.987500         3878        80.00
       7.535     0.989062         3885        91.43
       7.619     0.990625         3891       106.67
       7.719     0.992188         3897       128.00
       7.755     0.992969         3900       142.22
       7.799     0.993750         3903       160.00
       7.883     0.994531         3906       182.86
       8.015     0.995313         3909       213.33
       8.103     0.996094         3912       256.00
       8.159     0.996484         3914       284.44
       8.239     0.996875         3915       320.00
       8.287     0.997266         3917       365.71
       8.343     0.997656         3918       426.67
       8.455     0.998047         3920       512.00
       8.607     0.998242         3921       568.89
       8.607     0.998437         3921       640.00
       8.631     0.998633         3922       731.43
       8.991     0.998828         3924       853.33
       8.991     0.999023         3924      1024.00
       8.991     0.999121         3924      1137.78
       8.991     0.999219         3924      1280.00
       9.351     0.999316         3925      1462.86
       9.351     0.999414         3925      1706.67
       9.359     0.999512         3926      2048.00
       9.359     0.999561         3926      2275.56
       9.359     0.999609         3926      2560.00
       9.359     0.999658         3926      2925.71
       9.359     0.999707         3926      3413.33
      27.855     0.999756         3927      4096.00
      27.855     1.000000         3927          inf
#[Mean    =        3.297, StdDeviation   =        1.911]
#[Max     =       27.840, Total count    =         3927]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5934 requests in 30.05s, 25.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 3312
Requests/sec:    197.50
Transfer/sec:      0.86MB